set_attribute lib_search_path {. /usr/local/rs41/libs}
set_attribute library {"SClib-max+ind.lib" "IO33lib-max+ind.lib" "/home/jiri/ibm/vhdl/temic/atc18/allmem.lib" } /
include leon3mp.rc
include atc18cond.rc
define_clock -period 5000 -name clock1 clk
synthesize -to_mapped
report_area
report_timing
